app/views/devneeds/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."devneed_id" = ?  [["devneed_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."devneed_id" = ?  [["devneed_id", 1]]
---
<h3 class="comments_title">
	<%= @devneed.comments.count %> Comments