app/controllers/comments_controller.rb

  def create
    @devneed = Devneed.find(params[:devneed_id])
    @comment = @devneed.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT  "devneeds".* FROM "devneeds" WHERE "devneeds"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "devneed_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "It would be good on bread"], ["devneed_id", 1], ["user_id", 1], ["created_at", "2016-03-08 21:06:59.666304"], ["updated_at", "2016-03-08 21:06:59.666304"]]