app/controllers/devneeds_controller.rb

  def index
    @devneeds = Devneed.all
---
SELECT "devneeds".* FROM "devneeds"

  def create
    @devneed = Devneed.new(devneed_params)

    respond_to do |format|
      if @devneed.save
---
INSERT INTO "devneeds" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-02-08 20:20:15.684366"], ["description", "I want a tool to migrate SVN repo to GIT repo"], ["title", "SVN to GIT"], ["updated_at", "2016-02-08 20:20:15.684366"]]

  def destroy
    @devneed.destroy
---
DELETE FROM "devneeds" WHERE "devneeds"."id" = ?  [["id", 3]]

  def upvote
    @devneed = Devneed.find(params[:id])
---
SELECT  "devneeds".* FROM "devneeds"  WHERE "devneeds"."id" = ? LIMIT 1  [["id", 11]]

  def downvote
    @devneed = Devneed.find(params[:id])
---
SELECT  "devneeds".* FROM "devneeds"  WHERE "devneeds"."id" = ? LIMIT 1  [["id", 11]]

    def set_devneed
      @devneed = Devneed.find(params[:id])
---
SELECT  "devneeds".* FROM "devneeds"  WHERE "devneeds"."id" = ? LIMIT 1  [["id", 2]]